{"ast":null,"code":"var projects = [{\n  title: 'Facebook Stories',\n  link: {\n    url: 'https://stories.fb.com',\n    title: 'Facebook stories'\n  },\n  subtitle: 'Marketing site for the Facebook Stories team.',\n  summary: ['Lead developer for a WordPress VIP site built to promote the Stories component of Facebook platform.', 'The project launch was scheduled to coincided with the teams F8 Conference presentation, so the timeline was fixed in advance. We developed quickly within a localized Docker instance to get development up to velocity, then ported over to the VIP platform and completed the build there.', 'The admin was built using custom fields to provide fully tailed content control to the Stories team to update content as necessary.'],\n  stack: ['WPVIP', 'Docker', 'PHPCS', 'ES6 Modules', 'Greensock Animations', 'SCSS']\n}, {\n  title: 'Uber Freight',\n  link: {\n    url: 'https://www.uberfreight.com/',\n    title: 'Uber Freight site'\n  },\n  subtitle: 'Onboarding site for the Uber Freight team',\n  summary: ['Work closely with the Uber Freight team to introduce new content and features to the Freight site.  The could be anything from building new React components in FusionJS, content migration, routing changes, or basic pixel adjustments and bug fixes to existing elements.', \"The site uses a Contentful JSON API backend, with a FusionJS / Styletron frontend.  Development work would go through a standard approval process on dev / staging environemnts, which would then be deployed using the client's internal system.\"],\n  stack: ['FusionJS', 'Styletron']\n}, {\n  title: 'Uber Brand',\n  link: {\n    url: 'https://brand.uber.com',\n    title: 'Uber brand guidelines'\n  },\n  subtitle: 'Uber brand guidelines site',\n  summary: [\"A centralized guideline site for Uber's various teams to reference logo usage, typography, motion studies, photography usage, and more.\", 'As a member of this dev team, I built out React components for the site using a tightly controlled theming system. Colors, Line height, Animation curves, buttons and more all had to be precisely consistent across components.']\n}, {\n  title: 'Volkswagen USA',\n  link: {\n    title: 'vw.com',\n    url: 'https://vw.com'\n  },\n  subtitle: 'VW USA Home page',\n  summary: ['Needing to sell thru a home page redesign, the client was having a difficult time visualizing the cost/benefit design choices presented. Tasked with building a full-fidelity prototype with no runway, I quickly contructed a stand-alone scaffold of the existing VW site to deliver a new protocype in with the design team.  With little runway, I executed a behaviorly complete design in browser. It was constructed with live copies of existing HTML scaffold, and siting along side all JavaScript and CSS libraries running in production to provide the implementation team with the lowest possible barrier to execution.'],\n  stack: ['ES6', 'SCSS', 'Gulp', 'jQuery', 'HTML', 'Gulp Middleware vai Express']\n}, // {\n//   title: 'Tacobell.com',\n//   link: {\n//     url: 'http://ta.co'\n//   },\n//   summary: [\n//     \"Bringing mobile ordering outside the app store.  My team was tasked with providing an integrated mobile and desktop experiences that leveraged existing APIs and services build for Taco Bell's mobile app. My primary responsibility during construction was a feature rich checkout process for guest and registered users, user conversion, and a side chained interface for reloading prepaid cards during checkout.\",\n//     'This site has since been proted to a new platform so much of the original work has been been written again.'\n//   ],\n//   stack: ['HTML', 'BackBone', 'SCSS']\n// },\n{\n  title: 'Uber Marketplace',\n  link: {\n    url: 'https://marketplace.uber.com'\n  },\n  summary: ['Model out site structure and content using the agency’s Contentful account, and eventually migrate to Uber’s account.', 'Build out fully functional React components for the Marketplace site based on third-party designs.', 'Provide technical feedback on design files for ease of implementation, with suggested revisions.', 'Oversee development of other components, review pull requests, and manage repository branches and tags.'],\n  stack: ['React', 'FusionJS', 'Styletron', 'Contentful']\n}, {\n  title: 'Eminem: Revival',\n  link: {\n    url: 'http://www.deutsch.com/projects/revival'\n  },\n  subtitle: ' A short turn-around album teaser for Interscope records',\n  summary: ['Interscope was referred to our agency to handle rapid development for marketing efforts on the new Eminem album “Revival”. I was tasked with quickly building'],\n  stack: ['HTML', 'SCSS', 'Gulp', 'AWS']\n}];\nexport { projects };","map":null,"metadata":{},"sourceType":"module"}